app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["username", "slaflam"], ["password", "zigzag"], ["created_at", "2021-01-23 02:32:22.326685"], ["updated_at", "2021-01-23 02:32:22.326685"]]
---
  def create
    byebug
    user = User.create(params.require(:user).permit(:username, :password))